Repository: FPGAwars/iceFF
Catalog: locale/*/*.po
Languages: es_es

source: DFF-rst. D Flip-Flop with load and reset. Implemented in verilog
es_es: DFF-rst. Biestable D con load y reset. Implementación en verilog

source: DFF
es_es: Biestable D

source: DFF. D Flip-flop. Verilog implementation
es_es: DFF. Biestable D. Implementación en verilog

source: Sys-DFF-ld-rst-verilog. System - D Flip-flop. Capture data every system clock cycle. from input si. If load is active, the data is captured from the d input. Reset input. Verilog implementation
es_es: Sys-DFF-ld-rst-verilog. Biestable D del sistema. Captura datos en cada ciclo del sistema de la entrada si. Si load está activo, los datos se capturan de la entrada d. Entrada de reset. Implementación en Verilog

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: System clock
es_es: Reloj del sistema

source: Input data (serial)
es_es: Dato de entrada (Serie)

source: Output
es_es: Salida

source: # D Flip-Flop (system) with load and reset It stores the input data that arrives at cycle n Its output is shown in the cycle n+1 The data is captured from input si. If load is active the data is captured from input d Reset input
es_es: # Biestable D (Sistema) con load y reset Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1 El dato se captura de la entrada si. Si load está activo el dato se captura de la entrada d Entrada de reset

source: Not connected
es_es: No conectado

source: Input data (Paralell)
es_es: Dato de entrada (Paralelo)

source: Load control
es_es: Control de carga

source: Sys-DFF-ld-verilog. System - D Flip-flop. Capture data every system clock cycle. from input si. If load is active, the data is captured from the d input. Verilog implementation
es_es: Sys-DFF-ld-verilog. Biestable D del sistema. Captura datos en cada ciclo del sistema de la entrada si. Si load está activo, los datos se capturan de la entrada d. Implementación en Verilog

source: # D Flip-Flop (system) with load It stores the input data that arrives at cycle n Its output is shown in the cycle n+1 The data is captured from input si. If load is active the data is captured from input d
es_es: # Biestable D (Sistema) con carga Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1 El dato se captura de la entrada si. Si load está activo el dato se captura de la entrada d

source: Sys-DFF-rst: D Flip flop with reset input. When rst=1, the DFF is set to it initial value. Verilog implementation
es_es: Sys-DFF-rst: Biestable D con entrada de reset. Cuando rst=1, el biestble D se carga con su valor inicial. Implementación en verilog

source: Data input
es_es: Entrada de datos

source: Initial default value: 0
es_es: Valor inicial por defecto: 0

source: Reset input
es_es: Entrada de reset

source: System - D Flip-flop. Capture data every system clock cycle. Verilog implementation
es_es: Biestable D del sistema. Capturar un dato cada ciclo de reloj del sistema. Implementación en verilog

source: Input data
es_es: Dato de entrada

source: # D Flip-Flop (system) It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D (Sistema) Almacena el dato de entrada que llega en el ciclo n Su salida se muestra en el ciclo n+1

source: DFF-rst. D Flip-Flop with load and reset- Block implementation
es_es: DFF-rst. Biestable D con load y reset. Implementación mediante bloques

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor de 2 a 1 (Canales de 1 bit)

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de dos bits de entrada

source: Two bits input And gate
es_es: Puerta AND de dos bits de entrada

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementación en verilog)

source: Input
es_es: Entrada

source: System - D Flip-flop. Capture data every system clock cycle. Block implementation
es_es: Biestable D del sistema. Capturar un dato cada ciclo de reloj del sistema. Implementación mediante bloques

source: MuxF-2-1-verilog: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: MuxF-2-1-verilog: Multiplexor de 2 a 1 (Canales de 1-bit). Version invertida

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: Sys-DFF-ld-rst. System - D Flip-flop. Capture data every system clock cycle. from input si. If load is active, the data is captured from the d input. Reset input. Block implementation
es_es: Sys-DFF-ld-rst. Biestable D del sistema. Capturar un dato cada ciclo de reloj del sistema de la entrada si. Si load está activo el dato se captura de la entrada d. Entrada de reset. Implementación mediante bloques

source: 2-to-1 Multplexer (1-bit channels). Verilog implementation
es_es: Multiplexor de 2 a 1 (Canales de 1-bit). Implementación en Verilog

source: 1-bit generic constant (0/1)
es_es: constante genérica de 1-bit (0/1)

source: Sys-DFF-ld. System - D Flip-flop. Capture data every system clock cycle. from input si. If load is active, the data is captured from the d input. Block implementation
es_es: Sys-DFF-ld-rst. Biestable D del sistema. Capturar un dato cada ciclo de reloj del sistema de la entrada si. Si load está activo el dato se captura de la entrada d. Implementación mediante bloques

source: Sys-DFF-rst: D Flip flop with reset input. When rst=1, the DFF is set to it initial value. Block implementation
es_es: Sys-DFF-rst: Biestable D con entrada de reset. Cuando rst=1, el biestble D se carga con su valor inicial. Implementación mediante bloques

source: Reset input: Active high When rst=1, the DFF is set to its initial value
es_es: Entrada de reset: Activa a nivel alto Cuando rst=1, el biestable se carga con el valor inicial

source: RS-FF-reset. RS Flip-flop with priority reset. Verilog implementation
es_es: RS-FF-reset. Biestable RS con prioridad en reset. Implementación en verilog

source: RS-FF-set-verilog. RS Flip-flop with priority set. Implementation in verilog
es_es: RS-FF-set-verilog. Biestable RS con prioridad en set. Implementación en verilog

source: RS-FF-reset. RS Flip-flop with priority reset. Block implementation
es_es: RS-FF-reset. Biestable RS con prioridad en reset. Implementación mediante bloques

source: Constant bit 1
es_es: Bit 1 constante

source: Constant bit 0
es_es: Bit 0 constante

source: Priority for the reset
es_es: Prioridad en el reset

source: RS-FF-set. RS Flip-flop with priority set. Block implementation
es_es: RS-FF-set. Biestable RS con prioridad en set. Implementación mediante bloques

source: Priority for the set
es_es: Prioridad en set

source: Sys-TFF-rst: System TFF with reset: It toogles its output on every system cycle. Verilog implementation
es_es: Sys-TFF-rst: Biestable T del sistema con reset: Bascula su salida en cada ciclo de reloj del sistema. Implementación en verilog

source: Sys-TFF: System TFF: It toogles its output on every system cycle. Verilog implementation
es_es: Sys-TFF: TFF del sistema: Bascula su salida en cada ciclo del sistema. Implementación en verilog

source: TFF-rst-verilog: TFF with toggle input and reset: It toogles on every system cycle if the input is active. Verilog implementation
es_es: TFF-rst-verilog: Biestable T del sistema con entrada de cambio y reset: Bascula en cada ciclo del sistema si la entrada está activa. Implementación en verilog

source: TFF-verilog. System TFF with toggle input: It toogles on every system cycle if the input is active. Verilog implementation
es_es: TFF-verilog. Biestable T del sistema con entrada de cambio: Bascula en cada ciclo del sistema si la entrada está activa. Implementación en verilog

source: TFF-sys-rst. System TFF with reset: It toogles its output on every system cycle. Block implementation
es_es: TFF-sys-rst. Biestable T del sistema con reset: Bascula su salida en cada ciclo de reloj del sistema. Implementación mediante bloques

source: System TFF: It toogles its output on every system cycle
es_es: TFF del sistema: Bascula su salida en cada ciclo del sistema

source: TFF-rst-block: TFF with toggle input and reset: It toogles on every system cycle if the input is active. Block implementation
es_es: TFF-rst-block: Biestable T del sistema con entrada de cambio y reset: Bascula en cada ciclo del sistema si la entrada está activa. Implementación mediante bloques

source: Change the current output
es_es: Cambiar la salida actual

source: TFF-block. System TFF with toggle input: It toogles on every system cycle if the input is active. Block implementation
es_es: TFF-block. Biestable T del sistema con entrada de cambio: Bascula en cada ciclo del sistema si la entrada está activa. Implementación mediante bloques

source: # INDEX: IceFF Collection
es_es: # INDICE: Colección iceFF

source: System TFF
es_es: TFF del sistema

source: System TFF-rst
es_es: TFF-rst del sistema

source: Ledoscope. Capture the input signal during the first 4 cycles after circuit initialization
es_es: Ledoscope. Capturar la señal de entrada durante los 4 primeros ciclos de reloj tras la inicialización del circuito

source: SR-04-verilog: 4-bits Shift register to the right. Verilog implementation
es_es: SR-04-verilog: Registro de desplazamiento a la derecha de 4 bits. Implementación en verilog

source: 2-bits Syscounter
es_es: Contador del sistema de 2-bits

source: Inc1-2bit: Increment a 2-bits number by one
es_es: Inc1-2bit: Incrementar un número de dos bits en uno

source: AdderK-2bit: Adder of 2-bit operand and 2-bit constant
es_es: AdderK-2bit: Sumador de un operando y una constante de

source: Generic: 2-bits generic constant (0,1,2,3)
es_es: Genérico: Constante genérica de 2-bits (0,1,2,3)

source: Adder-2bits: Adder of two operands of 2 bits
es_es: Adder-2-bit: Sumador de dos operandos de 2 bit

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar un bus de 2-bits en sus dos cables

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1-bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1-bit: Sumador de dos operandos de 1 bit y el acarreo de entrada

source: XOR gate: two bits input xor gate
es_es: Puerta XOR: Puerta XOR de dos bits de entrada

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus2-Join-all: Agrupar dos cables en un bus de 2-bits

source: 02-Sys-reg: 2 bits system register. Verilog implementation
es_es: 02-Sys-reg: Registro del sistema de 2 bits. Implementación en verilog

source: ## Example. Sys-DFF: Initial pulse An Initial pulse is generated. Its initial value is 1, and then it change to 0 in the next cycle. The signal can be observed with the LEDOscope
es_es: ## Ejemplo. Sys-DFF: Pulso inicial Se genera un pulso inicial. Su valor inicial es 1 y despues se cambia a 0 en el siguiente ciclo. La señal se puede observar con el LEDOscopio

source: Initial value: cycle 0
es_es: Valor inicial: ciclo 0

source: Values for cycles >= 1
es_es: Valores para ciclos >= 1

source: Cycle 3 Cycle 2 Cycle 1 Cycle 0
es_es: Ciclo 3 Ciclo 2 Ciclo 1 Ciclo 0

source: The four initial cycles can be seen on the LEDs
es_es: Los cuatro ciclos iniciales se pueden ver en los LEDs

source: 4-bits Shift register
es_es: Registro de desplazamiento de 4-bits

source: The input channel is captured on the register. One bit per system clock
es_es: Se captura el canal de entrada en el registro. Un bit por ciclo del sistema

source: RS FlipFlop initialized to 1
es_es: Biestable RS inicializado a 1

source: while 1, the shift register is capturing
es_es: mientras sea 1, el registro de desplazamiento está capturando

source: 2-bits counter
es_es: contador de 2-bits

source: After 4 cycles the Flip-Flop is reset and it stops capturing bits
es_es: Tras 4 ciclos el Biestable se resetea y para de capturar bits

source: As the 2-bits system counter is counting all the time, the done signal is only generated when the counter reaches the maximum value and the Ledoscope is on (busy)
es_es: Mientras el contador del sistema de 2-bits está contando todo el tiempo, la señal de done se genera sólo cuando el contador alcanza el máximo valor y el LEDoscopio está encendido (busy)

source: 4bits constant value: 0
es_es: Valor constante de 4-bits: 0

source: Generic: 4-bits generic constant (0-15)
es_es: Genérico: Constante genérica de 4-bits (0-15)

source: ## Example. Sys-DFF: Delay An Initial pulse is delayed two cycles and shown on the LEDOscope
es_es: ## Ejemplo. Sys-DFF: Retraso Un pulso inicial se retrasa dos ciclos y se muestra en el LEDOscopio

source: ### Initial Pulse
es_es: ### Pulso inicial

source: Delay the initial pulse two cycles
es_es: Retrasar el pulso inicial dos ciclos

source: ## Example: Sys-DFF-rst: Generating a two cycles pulse A two cycles pulse is generated using the rst input
es_es: ## Ejemplo: Sys-DFF-rst: Generando un pulso de dos ciclos Un pulso de dos ciclos se genera usando la entrada de rst

source: cycle 1
es_es: ciclo 1

source: Rst on cycle 2
es_es: Rst en el ciclo 2

source: | Signal | Cycle 0 | Cycle 1 | Cycle 2 | Cycle 3 | |--------|---------|---------|---------|---------| | Pulse | 0 | 1 | 1 | 0 | | rst | 0 | 0 | 1 | 1 |
es_es: | Señal | Ciclo 0 | Ciclo 1 | Ciclo 2 | Ciclo3 | |--------|---------|---------|---------|---------| | Pulso | 0 | 1 | 1 | 0 | | rst | 0 | 0 | 1 | 1 |

source: **Pulse**
es_es: **Pulso**

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input. Block implementation
es_es: Detector de flanco de subida. Se genera un pulso de 1-ciclo (tic) cuando se detecta un flanco de subida en la entrada. Implementación mediante bloques

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. Not on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración del pull-up interno de la FPGA en el puerto de entrada

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: Remove the rebound on a mechanical switch
es_es: Eliminar el efecto rebote de un conmutador mecánico

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input. Block implementation
es_es: Detector de flancos. Se genera un pulso de 1-ciclo (tic cuando se detecta en la entrada bien un flanco de subida o uno de bajada. Implementación mediante bloques

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16-bits con reset

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16-bit: Sumador un operando de 16 bits y una constante de 16 bits

source: Generic: 16-bits generic constant
es_es: Genérico: Constante genérica de 16-bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Separar el bus de 16 bits en dos buses del mismo tamaño

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8-bit: Sumador de dos operandos de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar el bus de 8-bits en dos buses del mismo tamaño

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4-bit: Sumador de dos operandos de 4 bits

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Separar el bus de 4 bits en sus cables

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus4-Join-all: Agrupar todos los cables en un bus de 4 bits

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-Join-half: Agrupar las dos mitades iguales en un bus de 8-bits

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4-bit: Sumador de dos operandos de 4 bit y el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8-bit: Sumador de dos operandos de 8 bits y el acarreo de entrada

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-half: Agrupar las dos mitades iguales en un bus de 16-bits

source: 16-Sys-reg-rst: 16 bits system register with reset. Verilog implementation
es_es: 16-Sys-reg-rst: Registro del sistema de 16 bits con reset. Implementación en verilog

source: Sync-x01: 1-bit input with the system clock domain (Verilog implementation)
es_es: Sync-x01: Sincronizar una entrada de 1-bit con el dominio del reloj del sistema. Implementación en verilog

source: ## Example: DFF: Manual testing When the button is pressed, the DFF captures a 1 and the LED is turned on
es_es: ## Ejemplo: DFF: Prueba manual Cuando el botón se aprieta, el biestable D captura un 1 y el LED se enciende

source: Button state signal
es_es: Señal de estado del botón

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Se genera un pulso de 1-ciclo (tic) cuando se detecta un flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado de la señal actual

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo previo de reloj

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo previo de reloj era 0, significa que un flanco de subida se ha detectado! La salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Retardo**: 0 cyclos de reloj No hay retardo entre la llegada del flanco de subida y su detección

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interno * 0: no apagado * 1: Apagado

source: Synchronization stage
es_es: Estapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Estapa de normalización * 0: Cable * 1: Señal invertida

source: Debouncing stage
es_es: Estapa antirrebotes

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: Sólo un pin de la FPGA se puede conectar aquí!!!

source: The pull-up is connected by default
es_es: Se conecta el pull-up por defecto

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, actúa como una puerta NOT (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad para XOR |k|Entrada|Salida|Función| |--|--------------|----------|-------------| |0| 0 | 0 | cable | |0| 1 | 1 | cable | |1| 0 | 1 | Not | |1| 1 | 0 | Not |

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: En cuanto hay un cambio en la entrada, el contador se arranca

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su máximo valor, la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo del tiempo Para CLK=12MHZ, un contador de 16 bits alcanza su máximo cada 2**16 * 1/F = 5.5ms aprox Si se necesita más tiempo para el antirrebotes, usar un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay ningún cambio durante 5.5ms aprox. Cuando un valor es estable se captura en el biestable de salida

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genra un pulso de un ciclo (tic) cuando un flanco (de subida o bajada) se detecta en la señal de entrada

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actual es 1 y el previo 0, ó si el actual es 0 y el previo 1

source: In any other case the output is 0
es_es: En cualquier otro caso la salida es 0

source: Button-tic: Configurable button that emits a tic when it is pressed. ECP5 FPGA Family
es_es: Button-tic: Botón configurable que emite un tic cuando se aprieta. Familia ECP5 de FPGA

source: Configurable button (pull-up on/off. Not on/off). ECP5 FPGA family
es_es: Botón configurable (pull-up on/off. Not on/off). Familia ECP5 de FPGAs

source: ## Example: DFF-rst: Manual testing When the button is pressed, the DFF captures a 1 and the LED is turned on When the button 2 is pressed, the DFF is reset to 0 and the LED is turned off
es_es: ## Ejemplo: DFF-rst: Prueba manual Cuando el botón se aprieta, el biestable D captura un 1 y el LED se enciende Cuando el botón 2 se aprieta, el Biestable D se inicia a 0 y el LED se apaga

source: ## Example: Sys-TFF: Watching its output with the LEDOscope
es_es: ## Ejemplo: Sys-TFF: Observando su salida con el LEDOscopio

source: Watch the output with the LEDOscope
es_es: Observar la salida con el LEDOscopio

source: Display the output on LED7
es_es: Mostrar la salida en el LED7

source: Turn ON LED6 for comparing its brigthness to LED7
es_es: Encender el LED6 para compar su brillo con el LED7

source: Cycle 0
es_es: Ciclo 0

source: Cycle 1
es_es: Ciclo 1

source: Cycle 2
es_es: Ciclo 2

source: Cycle 3
es_es: Ciclo 3

source: Display the output on LED0
es_es: Mostrar la salida en el LED0

source: Turn ON LED6 for comparing its brigthness to LED1
es_es: Encender el LED6 para comparar su brillo con el LED1

source: # Example: TFF-sys-rst: Watching with the LEDOscope On cycle 2 the TFF-rst is reset to 0, so that its ouput on cycle 3 is also 0
es_es: # Ejemplo: TFF-sys-rst: Observando con el LEDOscopio

source: | Signal | Cycle 0 | Cycle 1 | Cycle 2 | Cycle 3 | |-----|---------|---------|---------|---------| | TFF | 0 | 1 | 0 | 0 |
es_es: | Señal | Ciclo 0 | Ciclo 1 | Ciclo 2 | Ciclo 3 | |-----|---------|---------|---------|---------| | TFF | 0 | 1 | 0 | 0 |

source: TFF output
es_es: Salida del TFF

source: **Sys-TFF-rst**
es_es: **Sys-DFF-rst**

source: This Flip-Flop is 1 on cycle 2
es_es: El biestable es 1 en el ciclo 2

source: # Example: TFF: Toggling a LED with a button When the buton is pressed, the LED is toggled
es_es: # Ejemplo: TFF: Alternando un LED con un botón Cuando el botón se aprieta, el LED cambia

source: # Example: TFF-rst: Manual testing
es_es: # Ejemplo: TFF-rst: Prueba manual

source: Toogle
es_es: Cambio
