Repository: FPGAwars/iceFF
Catalog: locale/*/*.po
Languages: es_es

source: ## Example. RS-Flip-flip with priority on set: Manual testing The SW1 and SW2 buttons are used for activating the set and reset inputs respectivelly. The Flip-Flop state is shown on the LED
es_es: ## Ejemplo. Biestable RS con prioridad en el set: Prueba manual Los botones SW1 y SW2 se usan para activar las entradas de set y reset respectivamente. El estado del Biestable se muestra en el LED

source: Nandlang-go-board
es_es: Nandland-go-board

source: ## Example. RS-Flip-flip with priority on Reset: Manual testing The SW1 and SW2 buttons are used for activating the set and reset inputs respectivelly. The Flip-Flop state is shown on the LED
es_es: ## Ejemplo. Biestable RS con prioridad en el reset: Prueba manual Los botones SW1 y SW2 se usan para activar las entradas de set y reset respectivamente. El estado del Biestable se muestra en el LED
